tests/performance/load-test.yml
config:
  target: 'http://localhost:8001'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Load test"
    - duration: 60
      arrivalRate: 20
      name: "Stress test"

scenarios:
  - name: "Recipe Generation Flow"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "demo@test.com"
            password: "password123"
          capture:
            json: "$.id"
            as: "userId"
      - post:
          url: "/api/recipes/generate"
          json:
            user_id: "{{ userId }}"
            cuisine_type: "italian"
            difficulty: "easy"
            servings: 4
          expect:
            - statusCode: 200

  - name: "Recipe History Access"
    weight: 30
    flow:
      - get:
          url: "/api/recipes/history/test-user-id"
          expect:
            - statusCode: 200
      - think: 2

  - name: "Recipe Detail Viewing"
    weight: 20
    flow:
      - get:
          url: "/api/recipes/history/test-user-id"
          capture:
            json: "$.recipes[0].id"
            as: "recipeId"
      - get:
          url: "/api/recipes/{{ recipeId }}/detail"
          expect:
            - statusCode: 200

  - name: "Walmart Integration"
    weight: 10
    flow:
      - post:
          url: "/api/v2/walmart/weekly-cart-options"
          json:
            recipe_id: "test-recipe-id"
          expect:
            - statusCode: 200